Revit 2026 API

# OrdinateTextOrientation Enumeration

---

The ordinate dimension text orientation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum OrdinateTextOrientation
```
```vb
Public Enumeration OrdinateTextOrientation
```
```cpp
public enum class OrdinateTextOrientation
```
```fsharp
type OrdinateTextOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| ParallelToDimensionLine | 0 | The dimension text orientation will be parallel to dimension line. |
| ParallelToWitnessLine | 1 | The dimension text orientation will be parallel to witness line. |

#### Reference

Autodesk.Revit.DB Namespace